#### FabricationPartPlacementUtils Class

---

|  |
| --- |
| See Also |

General utility placement methods in the Autodesk Revit MEP product for fabrication.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static class FabricationPartPlacementUtils ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class FabricationPartPlacementUtils ``` |

| Visual C++ |
| --- |
| ``` public ref class FabricationPartPlacementUtils abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Fabrication FabricationPartPlacementUtils

# See Also

Autodesk.Revit.DB.Fabrication Namespace